{"keras_version": "2.0.7", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "filters": 4, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "filters": 8, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "name": "conv2d_3", "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "filters": 16, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"units": 10, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}